shibshib/SenSync/Sync/MSP430/PS2Keyboard/hal.c
/*
 * hal.c
 *
 *  Created on: Feb 21, 2017
 *      Author: Ala
 */


/* --COPYRIGHT--,BSD
 * Copyright (c) 2016, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * --/COPYRIGHT--*/
/*
 * ======== hal.c ========
 *
 */
#include <msp430.h>

#include "driverlib.h"

#include "USB_API/USB_Common/device.h"
#include <descriptors.h>


#include "hal.h"

#define GPIO_ALL    GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3| \
                    GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7



/*
* This function drives all the I/O's as output-low, to avoid floating inputs
* (which cause extra power to be consumed).  This setting is compatible with
 * TI FET target boards, the F5529 Launchpad, and F5529 Experimenters Board;
 * but may not be compatible with custom hardware, which may have components
 * attached to the I/Os that could be affected by these settings.  So if using
* other boards, this function may need to be modified.
*/
void USBHAL_initPorts(void)
{
#ifdef __MSP430_HAS_PORT1_R__
    GPIO_setOutputLowOnPin(GPIO_PORT_P1, GPIO_ALL);
    GPIO_setAsOutputPin(GPIO_PORT_P1, GPIO_ALL);
#endif

#ifdef __MSP430_HAS_PORT2_R__
    GPIO_setOutputLowOnPin(GPIO_PORT_P2, GPIO_ALL);
    GPIO_setAsOutputPin(GPIO_PORT_P2, GPIO_ALL);
#endif

#ifdef __MSP430_HAS_PORT3_R__
    GPIO_setOutputLowOnPin(GPIO_PORT_P3, GPIO_ALL);
    GPIO_setAsOutputPin(GPIO_PORT_P3, GPIO_ALL);
#endif

#ifdef __MSP430_HAS_PORT4_R__
    GPIO_setOutputLowOnPin(GPIO_PORT_P4, GPIO_ALL);
    GPIO_setAsOutputPin(GPIO_PORT_P4, GPIO_ALL);
#endif

#ifdef __MSP430_HAS_PORT5_R__
    GPIO_setOutputLowOnPin(GPIO_PORT_P5, GPIO_ALL);
    GPIO_setAsOutputPin(GPIO_PORT_P5, GPIO_ALL);
#endif

#ifdef __MSP430_HAS_PORT6_R__
    GPIO_setOutputLowOnPin(GPIO_PORT_P6, GPIO_ALL);
    GPIO_setAsOutputPin(GPIO_PORT_P6, GPIO_ALL);
#endif

#ifdef __MSP430_HAS_PORT7_R__
    GPIO_setOutputLowOnPin(GPIO_PORT_P7, GPIO_ALL);
    GPIO_setAsOutputPin(GPIO_PORT_P7, GPIO_ALL);
#endif

#ifdef __MSP430_HAS_PORT8_R__
    GPIO_setOutputLowOnPin(GPIO_PORT_P8, GPIO_ALL);
    GPIO_setAsOutputPin(GPIO_PORT_P8, GPIO_ALL);
#endif

#ifdef __MSP430_HAS_PORT9_R__
    GPIO_setOutputLowOnPin(GPIO_PORT_P9, GPIO_ALL);
    GPIO_setAsOutputPin(GPIO_PORT_P9, GPIO_ALL);
#endif

#ifdef __MSP430_HAS_PORTJ_R__
    GPIO_setOutputLowOnPin(GPIO_PORT_PJ, GPIO_ALL);
    GPIO_setAsOutputPin(GPIO_PORT_PJ, GPIO_ALL);
#endif
}


/*
 * Function to initialize the ACLK and MCLK
 * for use later by timers.
 *
void initClocks() {

    UCS_initClockSignal(       // clockSignalInit in previous driverlib
        UCS_ACLK,               // Set the auxiliary clock, using the
        UCS_DCOCLK_SELECT,     // DCO oscillator (less accurate than XT1)
        UCS_CLOCK_DIVIDER_2     // keep value, divide by 2 (final speed: 1 MHz)
    );

    UCS_initClockSignal(
            UCS_SMCLK,               // Set Sub-Main clock
            UCS_XT1CLK_SELECT,      // using XT1 32KHz Crystal (more accurate than REF clk)
            UCS_CLOCK_DIVIDER_2     // keep value, divide by 1
    );
} */

void initClocks() {
    // Important First Steps: Configure Pins for Crystals!
       // All to port P5
       // PIN5 -> XT1 OUT
       // PIN4 -> XT1 IN
       // PIN3 -> XT2 OUT
       // PIN2 -> XT1 IN

       GPIO_setAsPeripheralModuleFunctionInputPin(
           GPIO_PORT_P5,
           GPIO_PIN4+GPIO_PIN2
       );

       GPIO_setAsPeripheralModuleFunctionOutputPin(
           GPIO_PORT_P5,
           GPIO_PIN5+GPIO_PIN3
       );

       // YOU HAVE to inform the system of the crystal frequencies
       // You probably want to use #defines for these values

       UCS_setExternalClockSource(
           32768,  // Frequency of XT1 in Hz.
           4000000 // Frequency of XT2 in Hz.
       );

       // Initialize the crystals

       UCS_turnOnXT2( // was UCS_XT2Start in previous driverlib
           UCS_XT2_DRIVE_4MHZ_8MHZ
       );

       UCS_turnOnLFXT1( //was UCS_LFXT1Start in previous driverlib
           UCS_XT1_DRIVE_0,
           UCS_XCAP_3
       );

    // Set up clocks
       UCS_initClockSignal(
               UCS_MCLK,
               UCS_XT2CLK_SELECT,
               UCS_CLOCK_DIVIDER_1
       );


       UCS_initClockSignal(
           UCS_SMCLK,               // Set SMCLK
           UCS_XT2CLK_SELECT,       // XT2 is the source, 4MHz
           UCS_CLOCK_DIVIDER_1
       );

       UCS_initClockSignal(
           UCS_ACLK,                // Set ACLK
           UCS_DCOCLK_SELECT,       // DCO is the source, 2 MHz
           UCS_CLOCK_DIVIDER_1
       );
}
//Released_Version_5_10_00_17
